/* 
  Model.strings
  Secrets

  Created by Paulo Andrade on 23/01/14.
  Copyright (c) 2016 Outer Corner. All rights reserved.
*/


// Generic
"Generic.InvalidValue" = "Valor no válido para %@";
"Generic.CreationDate" = "Creado";
"Generic.ModificationDate" = "Modificado";
"Generic.Notes" = "Notas";
"Generic.Tags" = "Etiquetas";
"Generic.Secret.Single" = "Secret";
"Generic.Secret.Plural" = "Secrets";

/* Item title after a copy */
"Generic.CopiedItemName" = "Copiar %@";

// Credentials
"Credential.Single" = "Inicio de sesión";
"Credential.Plural" = "Inicios de sesión";
"Credential.New" = "Nuevo inicio de sesión";
"Credential.Items" = "%d inicios de sesión";

"Credential.Properties.identifier" = "Nombre de usuario";
"Credential.Properties.secret" = "Contraseña ";
"Credential.Properties.secrets" = "Historial de contraseñas";
"Credential.Properties.services" = "Servicios";
"Credential.Properties.tags" = "Etiquetas";

// Softwared licenses
"SoftwareLicense.Single" = "Licencia de software";
"SoftwareLicense.Plural" = "Licencias de software";
"SoftwareLicense.Software" = "Software";
"SoftwareLicense.License.Single" = "Licencia";
"SoftwareLicense.New" = "Nueva licencia";
"SoftwareLicense.Items" = "%d licencias";

"SoftwareLicense.Properties.key" = "Clave de licencia";
"SoftwareLicense.Properties.orderNumber" = "Número de pedido";
"SoftwareLicense.Properties.orderTotal" = "Total de pedidos";
"SoftwareLicense.Properties.owner" = "Propietario de licencia";
"SoftwareLicense.Properties.publisher" = "Editorial";
"SoftwareLicense.Properties.purchaseDate" = "Fecha de compra";
"SoftwareLicense.Properties.supportEmail" = "E-mail de asistencia";
"SoftwareLicense.Properties.version" = "Versión del software";
"SoftwareLicense.Properties.website" = "Sitio web";

// Wallet
"Wallet.Single" = "Cartera";
"WalletItem.Single" = "Elemento de cartera";
"WalletItem.Plural" = "Elementos de cartera";
"Wallet.Items" = "%d elementos de cartera";

// Bank Account
"BankAccount.Single" = "Cuenta bancaria";
"BankAccount.Plural" = "Cuentas bancarias";
"BankAccount.New" = "Nueva cuenta bancaria";

"BankAccount.Properties.accountHolder" = "Titular de la cuenta";
"BankAccount.Properties.bankName" = "Banco";
"BankAccount.Properties.iban" = "IBAN";
"BankAccount.Properties.number" = "Número de cuenta";
"BankAccount.Properties.routingNumber" = "Número de encaminamiento";
"BankAccount.Properties.swiftCode" = "SWIFT";

// Credit card
"CreditCard.Single" = "Tarjeta de crédito";
"CreditCard.Plural" = "Tarjetas de crédito";
"CreditCard.New" = "Nueva tarjeta de crédito";

"CreditCard.Brand.visa" = "Visa";
"CreditCard.Brand.mastercard" = "MasterCard";
"CreditCard.Brand.amex" = "American Express";
"CreditCard.Brand.diners" = "Diners Club";
"CreditCard.Brand.discover" = "Discover";
"CreditCard.Brand.jcb" = "JCB";
"CreditCard.Brand.solo" = "Solo";
"CreditCard.Brand.maestro" = "Maestro";
"CreditCard.Brand.visaelectron" = "Visa Electron";
"CreditCard.Brand.other" = "Otros";

"CreditCard.Properties.pan" = "Número de tarjeta ";
"CreditCard.Properties.cardholder" = "Titular de la tarjeta";
"CreditCard.Properties.expirationDate" = "Fecha de caducidad";
"CreditCard.Properties.brand" = "Sucursal";
"CreditCard.Properties.pin" = "PIN";
"CreditCard.Properties.securityCode" = "Código de seguridad";

"CreditCard.Errors.InvalidPAN" = "El número de tarjeta de crédito debe ser una secuencia de dígitos.";

// Notes
"Note.Single" = "Nota";
"Note.Plural" = "Notas";
"Note.New" = "Nueva nota";
"Note.Items" = "%d nota(s)";

// Service
"Service.URL" = "URL";

"Service.Properties.address" = "Dirección";

"Service.Errors.InvalidAddress" = "La dirección de servicio debe ser una dirección válida.";

// One-Time Passwords
"OneTimePassword.Single" = "Contraseña de uso único";
"OneTimePassword.Plural" = "Contraseñas de uso único";
"OneTimePassword.Seed.Long" = "Secreto de contraseña de uso único";
"OneTimePassword.Seed.Short" = "Secreto de CUU";

